[
      {
      "ArticleInfoId": "1",
      "Type": "article",
      "Title": "Block Ads Through Your WiFi",
      "Author": "Herman Toro",
      "Topic": "Tech",
      "Tags": "hacking networking",
      "Views": "0",
      "Shares": "0",
      "Caption": "Looking for a way to block ads on all of your household devices? You have choices.",
      "Active": "True",
      "RenderString": "<br /><div style=\"margin-top:1rem\" /> So I pickup my my iphone and head over to my favorite “fake news” source to read the headlines but something is obviously not right and it cannot be ignored anymore. Ads have taken over most of my small 4 inch iphone screen!<br /><div style=\"display:flex;justify-content:center\"><img src=\"https://scontent-atl3-1.xx.fbcdn.net/v/t1.0-9/15823503_10211482690122198_6115729511554926696_n.jpg?oh=780e401f99a3acef1574127328f85920&amp;oe=59893119\" /></div><br />To make matters worse, I scroll down one time and they kill me with a MODAL AD.<br /><div style=\"display:flex;justify-content:center\"><img src=\"https://scontent-atl3-1.xx.fbcdn.net/v/t1.0-9/15780749_10211482814805315_7388719650305063511_n.jpg?oh=048ddabf97fb203febe21acb4ae63f18&amp;oe=59816591\" /></div><br />OK time to fix this problem. But how?<br />* Ads are blocked on my laptop using an extension on my browser called adblockplus. They have an app for iphone, less than $2. * It would nice to get rid of ads on all the devices in my house not just my phone, like kid's tablet, wife's phone, fire stick, etc.<br />  \n## Try One:<br />  \n1. First I started reading into Pi-Hole. Its a DNS service that can be configured to run 24hrs on my RaspberryPi. Someone on Reddit mentioned that it blocks ads before they are downloaded, so it can actually speed up the network.<br />2. How about we just throw money at the problem? I found a $99 device called adtrap that is supposed to bring me nerdvana.<br />3. A few years ago I installed custom firmware on my wifi router, just a regular old router purchased from Walmart. I chose to flash DD-WRT over Tomato for obvious reasons. At the time, my idea was to run a VPN service directly on the router, but alas I could never get it to work. Now, if there was only a way to program the router to block all unwanted traffic leveraging the DD-WRT firmware to run a linux script on startup.<br />  \n## In the End<br />  \n<div style=\"display:flex;justify-content:center\"><img src=\"https://scontent-atl3-1.xx.fbcdn.net/v/t1.0-9/15823538_10211482882006995_8059369527530329168_n.jpg?oh=3a2c3062d38dd72238a32b6edaca3fbe&amp;oe=598DFDEF\" /></div><br />I really wanted to try #1 but decided on #3 instead. It turned out to be the right choice considering how quickly I was able set it up, thanks to this forum thread.  Basically, you give the wifi router a list of domains of known ad servers, then just block them. Of course you have to keep your list up to date, but that can be rolled into the script.<br />"
      }
    ]